package com.example.crawling.common;

import lombok.Getter;
import lombok.RequiredArgsConstructor;

@Getter
@RequiredArgsConstructor
public enum SubAreaCode {

    /* 서울 */
    GANGNAM(20, "강남/역삼/삼성/논현"),
    SEOCHO(900517, "서초/신사/방배"),
    JAMSIL(21, "잠실/신천(잠실새내)"),
    YEONGDEUNGPO(900695, "영등포/여의도"),
    SINRIM(24, "신림/서울대/사당/동작"),
    CHEONHO(900518, "천호/길동/둔촌"),
    HWAGOK(22, "화곡/까치산/양천/목동"),
    GURO(900696, "구로/금천/오류/신도림"),
    SINCHON(28, "신촌/홍대/합정"),
    YEONSINNAE(900519, "연신내/불광/응암"),
    JONGNO(900520, "종로/대학로/동묘앞역"),
    SUNGSHIN(900535, "성신여대/성북/월곡"),
    ITAEWON(27, "이태원/용산/서울역/명동/회현"),
    DONGDAEMUN(900556, "동대문/을지로/충무로/신당/약수"),
    HUIGI(25, "회기/고려대/청량리/신설동"),
    JANGAN(900557, "장안동/답십리"),
    GEONDAE(900521, "건대/군자/구의"),
    WANGSHIMRI(900555, "왕십리/성수/금호"),
    SUYU(26, "수유/미아"),
    SANGBONG(900522, "상봉/중랑/면목"),
    TAERUNG(900558, "태릉/노원/도봉/창동"),

    /* 경기 */
    SUWON_INGI(910028, "수원 인계동/나혜석거리"),
    SUWON_STATION(910029, "수원역/구운/행궁/장안구"),
    SUWON_CITY_HALL(910030, "수원시청/권선/영통/세류"),
    ANYANG(33, "안양/평촌/인덕원/과천"),
    SEONGNAM(31, "성남/분당/위례"),
    YONGIN(100097, "용인"),
    DONGTAN(900523, "동탄/화성/오산/병점"),
    HANAM(910033, "하남/광주(퇴촌/곤지암)"),
    YEOJU(910034, "여주/이천"),
    ANSAN_CENTRAL_STATION(910003, "안산 중앙역"),
    ANSAN_GOJAN(910004, "안산 고잔/상록수/선부동/월피동"),
    GUNPO(100098, "군포/의왕/금정/산본"),
    SIHEUNG(100099, "시흥(월곶/정왕/오이도/거북섬)"),
    GWANGMYEONG(900737, "광명"),
    PYEONGTAEK(35, "평택/송탄/안성"),
    BUCHEON(30, "부천"),
    ILSAN(900524, "일산/고양"),
    PAJU(900728, "파주"),
    GIMPO(900727, "김포"),
    UIJEONGBU(100093, "의정부"),
    GURI(900703, "구리"),
    NAMYANGJU_DASAN(900704, "남양주(다산/별내/와부/호평)"),
    NAMYANGJU_ONAM(910008, "남양주(오남/조안/화도/진접)"),
    POCHEON(900705, "포천"),
    YANGJU(900707, "양주/동두천/연천"),
    YANGPYEONG(900096, "양평"),
    GAPYEONG(900095, "가평/청평"),
    JEBUDO(34, "제부도/대부도"),

    /* 인천 */
    BUPIYEONG(39, "부평"),
    GUWOL(910035, "구월/소래포구/호구포"),
    SEOGU_SEOKNAM(900699, "서구(석남/서구청/검단)"),
    GYEYANG_JAKJEON(900700, "계양(작전/경인교대)"),
    JUAN(41, "주안"),
    SONGDO(100080, "송도/연수"),
    INCHEON_AIRPORT(900701, "인천공항/을왕리/영종도"),
    DONGAM(900579, "동암/간석"),
    YONGHYEON(910036, "용현/숭의/월미도/신포/동인천/연안부두"),
    GANGHWA(900729, "강화/옹진"),

    /* 강원 */
    CHUNCHEON(46, "춘천/강촌"),
    WONJU(900536, "원주"),
    GYEONGPODAE(900608, "경포대/사천/주문진/정동진"),
    GANGNEUNG_STATION(900094, "강릉역/교동/옥계"),
    YEONGWOL(47, "영월/정선"),
    SOKCHO(48, "속초/고성"),
    YANGYANG(910000, "양양(서피비치/낙산)"),
    DONGHAE(49, "동해/삼척/태백"),
    PYEONGCHANG(900097, "평창"),
    HONGCHEON(900098, "홍천/횡성"),
    HWACHEON(900099, "화천/철원/인제/양구"),

    /* 제주 */
    JEJU_AIRPORT_WEST(910025, "제주공항 서부(용담,도두,연동,노형동)"),
    JEJU_AIRPORT_EAST(910026, "제주공항 동부(제주시청,탑동,건입동)/추자도"),
    SEOGWIPO(6615, "서귀포시/중문/모슬포"),
    IHOTEU(100010, "이호테우/하귀/애월/한림/협재"),
    HAMDEOK(910011, "함덕/김녕/세화"),
    NAMWON_PYOSEON(910012, "남원/표선/성산"),

    /* 대전 */
    YUSEONG_GU(43, "유성구"),
    JUNG_GU(44, "중구(은행/대흥/선화/유천)"),
    DONG_GU(900526, "동구(용전/복합터미널)"),
    SEO_GU(900525, "서구(둔산/용문/월평)"),
    DAEDEOK_GU(45, "대덕구(중리/신탄진)"),

    /* 충북 */
    CHEONGJU_HEUNGDEOK(50, "청주 흥덕구/서원구(청주 터미널)"),
    CHEONGJU_SANGDANG(900537, "청주 상당구/청원구(청주국제공항)"),
    CHUNGJU(900578, "충주/수안보"),
    JECHON(51, "제천/단양"),
    JINCHEON(910007, "진천/음성"),
    BOEUN(52, "보은/옥천/괴산/증평/영동"),

    /* 충남 */
    CHEONAN_SEOBUK(900711, "천안 서북구"),
    CHEONAN_DONGNAM(900710, "천안 동남구"),
    ASAN(900576, "아산"),
    GONGJU(900527, "공주/동학사/세종"),
    GYERYONG(54, "계룡/금산/논산/청양"),
    YESAN(900528, "예산/홍성"),
    TAAN(910031, "태안/안면도"),
    SEOSAN(910032, "서산"),
    DANGJIN(900708, "당진"),
    BORYEONG(56, "보령/대천해수욕장"),
    SEOCHUN(900577, "서천/부여"),

    /* 부산 */
    HAEUNDAE(57, "해운대/재송"),
    SONGJEONG(900529, "송정/오시리아"),
    GWANGANLI(900722, "광안리/수영"),
    KYUNGSEONGDAE(900725, "경성대/대연/용호동"),
    SEOMYUN(59, "서면/양정/부산시민공원"),
    NAMPO(900718, "남포동/중앙동/태종대/송도/영도"),
    BUSAN_STATION(900719, "부산역/범일동"),
    YEONSAN(900530, "연산/토곡"),
    DONGRAE(58, "동래/사직/미남/온천장/부산대/구서/서동"),
    SASANG(900552, "사상(경전철)/엄궁/학장"),
    DEOKCHEON(900714, "덕천/화명/만덕/구포"),
    HADAN(900726, "하단/명지/김해공항/다대포/강서/신호/괴정/지사"),

    /* 울산 */
    NAM_GU_JUNG_GU(6602, "남구/중구(삼산/성남/무거/신정)"),
    DONG_GU_BUK_GU_ULJU(100100, "동구/북구/울주군(일산/진장/진하/KTX역/영남알프스)"),

    /* 경남 */
    CHANGWON_SANGNAM(900723, "창원 상남동/용호동/중앙동/창원시청"),
    CHANGWON_MYUNGSEO(900724, "창원 명서동/봉곡동/팔용동/북면온천/창원종합버스터미널"),
    MASAN(910005, "마산"),
    JINHAE(910006, "진해"),
    KIMHAE(900531, "김해/장유"),
    YANGSAN(6604, "양산/밀양"),
    JINJU(900709, "진주"),
    GEOJE(900532, "거제/통영/고성"),
    SACHUN(900712, "사천/남해"),
    HADONG(900713, "하동/산청/함양"),
    GEOCHANG(900715, "거창/함안/창녕/합천/의령"),

    /* 대구 */
    DONGSEONG_RO(910019, "동성로/서문시장/대구역/경북대/엑스코"),
    DONGDAEGU_STATION(910020, "동대구역/신천동/수성못/범어/라이온즈파크/알파시티/시지"),
    DAEGU_AIRPORT(910021, "대구공항/혁신도시/동촌유원지/팔공산/이시아폴리스/군위"),
    SEODAEGU_STATION(910022, "서대구역/북부정류장/평리/비산/칠곡지구/동천동/금호지구"),
    DURYU(910023, "두류/이월드/본리동/죽전동/서부정류장/앞산공원/안지랑/대명동/봉덕동"),
    SEONGSEO(910024, "성서/계명대/상인동/대곡/현풍/테크노폴리스/가창/달성군"),

    /* 경북 */
    POHANG_NAM_GU(100057, "포항/남구(시청/시외버스터미널/구룡포/쌍사/문덕/오천)"),
    POHANG_BUK_GU(900649, "포항/북구(영일대/죽도시장/여객터미널/송도)"),
    GYEONGJU(6608, "경주(보문단지/황리단길/불국사/양남/감포/안강)"),
    GUMI(900100, "구미"),
    GYEONGSAN(900089, "경산(영남대/대구대/갓바위/하양/진량/자인)"),
    ANDONG(100065, "안동(경북도청/하회마을)"),
    YEONGCHUN(900650, "영천/청도"),
    GIMCHEON(6609, "김천/칠곡/성주"),
    MUNGYEONG(900551, "문경/상주/영주/예천/의성/봉화"),
    ULJIN(900090, "울진/영덕/청송"),
    ULLEUNGDO(100087, "울릉도"),

    /* 광주 */
    SANGMU(100062, "상무지구/금호지구/유스퀘어/서구"),
    CHUNGJANG_RO(100063, "충장로/대인시장/국립아시아문화전당/동구/남구"),
    CHEOMDAN(910009, "첨단지구/양산동"),
    GWANGJUYEODAE(910010, "하남/광주여대/송정역/광산구"),
    GWANGJU_STATION(900554, "광주역/기아챔피언스필드/전대사거리/북구"),

    /* 전남 */
    YEOSU(900511, "여수"),
    SUNGCHEON(900716, "순천"),
    GWANGYANG(900717, "광양"),
    MOKPO(910027, "목포"),
    MUAN(100067, "무안/영암/신안"),
    NAJU(900580, "나주/함평/영광/장성"),
    DAMYANG(900581, "담양/곡성/화순/구례"),
    HAENAM(100069, "해남/완도/진도/강진/장흥/보성/고흥"),

    /* 전주 */
    JEONJU_DEOKJIN(910001, "전주 덕진구"),
    JEONJU_WANSAN(910002, "전주 완산구/완주"),
    GUNSAN(100049, "군산"),
    IKSAN(900538, "익산"),
    NAMWON_IMSIL(900720, "남원/임실/순창/무주/진안/장수"),
    JEONGEUP(900721, "정읍/부안/김제/고창");

    private final int code;
    private final String name;
}
